tests/ab-tests/ab-dinamic.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking bazh_chat.ru (be patient)


Server Software:        nginx/1.14.0
Server Hostname:        bazh_chat.ru
Server Port:            80

Document Path:          /api/somewhat
Document Length:        182 bytes

Concurrency Level:      4
Time taken for tests:   1.347 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Keep-Alive requests:    9901
Total transferred:      3479505 bytes
HTML transferred:       1820000 bytes
Requests per second:    7422.66 [#/sec] (mean)
Time per request:       0.539 [ms] (mean)
Time per request:       0.135 [ms] (mean, across all concurrent requests)
Transfer rate:          2522.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   0.7      0      11
Waiting:        0    1   0.7      0      11
Total:          0    1   0.7      0      11
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      1
  95%      2
  98%      3
  99%      4
 100%     11 (longest request)